demo/singlePointCoupling/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType   laminar;

RAS
{
//    model           kOmegaSST;
     model           kEpsilon;
    turbulence      on;

    printCoeffs     on;
}

// RAS
// {
//     model           kEpsilon;
//
//     turbulence      on;
//
//     printCoeffs     on;
// }


//LES
//{
//    model           WALE;
//
//    turbulence      on;
//
//    printCoeffs     on;
//
//    delta           cubeRootVol;
//
//    cubeRootVolCoeffs
//    {
//        deltaCoeff      1;
//    }
//
//    PrandtlCoeffs
//    {
//        delta           cubeRootVol;
//        cubeRootVolCoeffs
//        {
//            deltaCoeff      1;
//        }
//
//        smoothCoeffs
//        {
//            delta           cubeRootVol;
//            cubeRootVolCoeffs
//            {
//                deltaCoeff      1;
//            }
//
//            maxDeltaRatio   1.1;
//        }
//
//        Cdelta          0.158;
//    }
//
//    vanDriestCoeffs
//    {
//        delta           cubeRootVol;
//        cubeRootVolCoeffs
//        {
//            deltaCoeff      1;
//        }
//
//        smoothCoeffs
//        {
//            delta           cubeRootVol;
//            cubeRootVolCoeffs
//            {
//                deltaCoeff      1;
//            }
//
//            maxDeltaRatio   1.1;
//        }
//
//        Aplus           26;
//        Cdelta          0.158;
//    }
//
//    smoothCoeffs
//    {
//        delta           cubeRootVol;
//        cubeRootVolCoeffs
//        {
//            deltaCoeff      1;
//        }
//
//        maxDeltaRatio   1.1;
//    }
//}
//



// ************************************************************************* //
